---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationChangeServiceParam
source: html/a19d722c-95ba-4b7b-92d6-92bc1050757c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationChangeServiceParam Property

"Change Service"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationChangeServiceParam { get; }
```